Catalogs/Секреты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Секреты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сейф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сейфы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТегиСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСекрета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСекретов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Секреты/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если Не ЗначениеЗаполнено(Сейф) Тогда
		Сейф = Справочники.Сейфы.Личный;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	Если ЭтоНовый() Тогда
		Если Сейф <> Справочники.Сейфы.Личный Тогда
			Если ПользователиПривилегированный.ЕстьПравоДобавленияСекретов() = Ложь Тогда
				ВызватьИсключение "Вам можно добавлять только личные секреты";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Для Каждого Строка Из Теги.НайтиСтроки(Новый Структура("Тег", "")) Цикл
		Теги.Удалить(Строка);
	КонецЦикла;
	ТегиСтрока = "#" + СтрСоединить(Теги.ВыгрузитьКолонку("Тег"), ", #");
	ТегиСтрока = СтрЗаменить(ТегиСтрока, "##", "#");
КонецПроцедуры
